"""Можливі режими для відкриття файлів:

Режим	Позначення
'r'	відкриття на читання (є значенням за замовчуванням).
'w'	відкриття на запис, вміст файлу видаляється, якщо файлу не існує, створюється новий.
'x'	відкриття на запис, якщо файлу не існує, інакше виключення.
'a'	відкриття на дозапис, інформація додається в кінець файлу.
'b'	відкриття у двоїчному режимі.
't'	відкриття у текстовому режимі (є значенням за замовчуванням).
'+'	відкриття на читання та запис"""


"""Реалізуйте функцію add_employee_to_file(record, path), яка у файл (параметр path - шлях до файлу) буде додавати співробітника (параметр record) у вигляді рядка "Drake Mikelsson,19".

Вимоги:

параметр record - співробітник у вигляді рядка виду "Drake Mikelsson,19"
кожен запис у файл має починатися з нового рядка.
необхідно щоб стара інформація у файлі теж зберігалася, тому при роботі з файлом відкрийте файл у режимі 'a', додайте співробітника record у файл і закрийте його
ми поки що не використовуємо менеджер контексту with"""


record = 'Drake Mikelsson,19'
path = r'./Python_Core/06/6_4.txt'

def add_employee_to_file(record, path):
    file = open(path, 'a')
    file.write(record + '\n')
    file.close()

add_employee_to_file(record, path)