"""Булевим називається вираз, що повертає тільки True або False. Такі вирази називаються булевими на честь Джорджа Буля (George Boole) (1815-1864) - піонера в галузі формальної логіки.

Для порівняння значень змінних між собою у Python є оператори відносин:

< (менше)
<= (менше або дорівнює)
> (більше)
>= (більше або дорівнює)
== (дорівнює)
!= (не дорівнює)
Приклад:

1 > 2  # False
bool — True/False підтип цілих чисел. Може приймати значення 1 (відповідає True) або 0 ( відповідає False)."""


"""Булевий тип часто використовують, щоб позначити стан об'єкта. Наприклад, змінна is_active може вказувати, чи активний обліковий запис користувача чи ні. Також акаунти користувачів часто не видаляють із бази даних, а просто встановлюють їм властивість is_delete – це називають soft delete (м'яке видалення). Тож встановіть змінній is_active істинне значення, а змінній is_delete — хибне."""


is_active = True
is_delete = False