"""Підіб'ємо короткий підсумок. Як бачимо, у Python змінні можуть бути різного типу. Це означає, що змінна може зберігати інформацію у різних форматах:

None — порожнє значення або "ніякий" тип даних.
Числа (Numeric Type)
Boolean — булев (логічний) тип. Є підтипом цілих чисел.
Рядки (Text Sequence Type)
З нового для нас тут лише тип None. Ним у Python позначають порожнє значення.

result = None
None використовується тоді, коли треба явно повернути якесь значення або створити його (зарезервувати ім'я для чогось) , але по суті й сенсу ніякої корисної інформації поки що зберегти в цьому значенні не можна, навіть якого роду ця інформація (рядок або число, або щось інше) поки що не ясно. У таких випадках застосовують None.

Інші типи ми розглянули вже докладно."""


"""Заведіть чотири змінні різного типу та надайте їм значення відповідного типу.

name — рядкова змінна
age — числова змінна
is_active — булева змінна
subscription — встановити значення None"""


name = str('Oleg')
age = int(45)
is_active = True
subscription = None