"""Коментарі в коді програми дуже корисні у будь-якій мові програмування. Поки що ми розглядаємо приклади програми, які досить прості, але зі зростанням складності коду в програми додають коментарі, що описують загальний підхід до розв'язуваної задачі, — свого роду нотатки, написані зрозумілою мовою. Ця інформація буває дуже корисною, якщо доводиться повертатися до своєї програми через довгий час або розумітися на коді, написаному іншим розробником. При виконанні програми комп'ютер ігнорує всі коментарі в коді, вони є там виключно для людини.

Для Python коментар починається з символу ґрат (#). Інтерпретатор Python ігнорує всі символи, що наведені в коді після # до кінця рядка. Приклад:

ratio = 10  # коефіцієнт корекції
result = 8 * (ratio + 5) - ratio ** 2"""


"""Знову повернемося до попереднього завдання. Додамо перед обчисленням змінної payment пояснювальний коментар. Закоментуйте текст 'Payment for electricity for the current month', щоб код став робочим."""


rate = 1.68
value_day = 358
value_night = 103
# Payment for electricity for the current month
payment = rate * value_day + rate / 2 * value_night