"""У більшості випадків програми визначають або збирають якісь набори даних, а потім трансформують їх під свої потреби. Виділимо основні типи даних для Python і почнемо з рядків тексту.

Рядок є простою послідовністю символів. Будь-яка послідовність символів, укладена в лапки, Python вважається рядком. Лапки можуть бути як одинарні, так і подвійні.

'First string'
"Second string" """


"""При покупці квитків нам завжди необхідно знати ім'я та прізвище покупця. Оголосимо дві рядкові змінні: first_name, яка містить ім'я, та змінну last_name, в яку помістимо прізвище користувача. Створіть ці дві змінні та привласніть їм своє ім'я та прізвище."""


first_name = 'Oleg'
last_name = 'Kondratenko'



