"""Найпоширеніші операції, які доводиться виконувати зі значеннями рядкових типів даних, — це їхня конкатенація, визначення довжини рядка та вилучення певних символів та підрядків. Але цим ми будемо займатися у модулі №5, а зараз поговоримо про конкатенацію.

Рядки в Python можна конкатенувати за допомогою оператора додавання (+). В результаті рядок, що стоїть праворуч оператора конкатенації буде додано в кінець рядка, що стоїть зліва, з утворенням нового рядкового значення.

first = 'Hello'
second = 'world'
sentence = first + ' ' + second + '!'  # Hello world!
У змінній sentence у нас в результаті опиниться рядок 'Hello world!'"""


"""При покупці квитків нам завжди необхідно знати ім'я та прізвище покупця. Оголосимо дві рядкові змінні: first_name, яка містить ім'я, та змінну last_name, в яку треба помістити прізвище покупця квитка. Створіть ці дві змінні та надайте їм своє ім'я та прізвище."""


first_name = 'Oleg'
last_name = 'Kondratenko'
full_name = first_name + ' ' + last_name