"""Настав час чисел. У програмуванні вони використовуються для ведення рахунку в іграх, представлення даних у візуалізаціях, зберігання інформації у вебдодатках тощо. У Python числові дані розділені на кілька категорій, згідно з тим, як вони використовуються. Найменше проблем для програміста приносить робота з цілими числами. Ми вже познайомилися з основними операціями над числами в одному з перших розділів.

У Python числа, що мають дробову частину, називаються дійсними числами (або, як заведено говорити, "числами з плаваючою комою"). Зазвичай ми їх використовуємо і не особливо замислюємося про поведінку цих чисел, але бувають ситуації, коли числа можуть поводитися несподівано для нас

a = 0.2 + 0.1  # 0.30000000000000004
Ця ситуація може статися незалежно від мови програмування, і пов'язана вона з внутрішнім представленням чисел комп' ютером. Тому порівняння дійсних чисел можливе лише з певною точністю, наприклад, до шостого знака після коми. Це коли порівнюють між собою не два числа, а їх різницю з точністю до 0.000001, та перевіряють вона менше точності чи ні. Якщо при обчисленнях точність стає важливою, варто звернути увагу на модуль decimal"""


"""Змінна length містить довжину, а змінна width — ширину кімнати. Необхідно зробити розрахунок площі кімнати та результат помістити в змінну area. Додайте змінну show, в яку помістіть рядок з наступним шаблоном: 'With width <значення ширини> and length <значення довжини> of the room, its area is equal to <значення площі>'."""


length = 2.75
width = 1.75
area = length * width
show = f'With width {width} and length {length} of the room, its area is equal to {area}'