"""Коли в програмуванні говорять про змінну, мають на увазі іменоване місце для зберігання даних, таких як числа, текст, списки з числами або символами та т.і. Якщо провести аналогію, то змінну можна визначити як ярлик, яким позначені певні дані.

Для створення змінних використовують таку конструкцію

field = 'name'
cost = 200
Імена змінних можуть складатися з латинських букв, цифр та знака підкреслення _, проте не можна, щоб змінна починалася з цифри. Прогалини в іменах змінних неприпустимі, але замість цього, слова розділяють знаками підкреслення, щоб ім'я змінної мало сенс, який ми вкладаємо при її використанні.

total_price = 120
І пам'ятайте, що змінні не повинні співпадати із зарезервованими словами мови. Інакше компілятор не зможе зрозуміти оператор це чи змінна."""


"""Створіть змінну name та привласніть їй ваше ім'я, наприклад 'Данило' Створіть змінну age і надайте їй значення свого віку"""


name = 'Oleg'
age = 45