"""Python - це мова з динамічною строгою типізацією. Це означає, що та сама змінна може змінювати свій тип в міру виконання нових інструкцій, але інтерпретатор автоматично не змінюватиме тип даних.

age = input("How old are you?")
Функція input повертає тип str — рядок і порівняти значення age з числом 18 — не можна, бо незрозуміло, як має відбуватися таке порівняння.

Але можна перетворити тип змінної age в int за допомогою вбудованої функції int (функція називається так само як і тип):

age = input("How old are you? ")
age = int(age)
Для перетворення рядків у числа з крапкою можна використовувати функцію float:

pi = float('3.14')
Також можна перетворити практично будь-який Python об'єкт у рядок функцією str:

pi_str = str(3.14)
age_str = str(29)
Для приведення інших типів даних до булевого типу використовується функція bool() Функція bool() поверне False у наступних випадках

порожній рядок
нульове число
порожній список/кортеж
В інших випадках функція поверне True

bool(0)  # False
bool(1)  # True"""


"""Повернімося до завдання з пункту 8 для розрахунку площі. Ширина та висота задані у рядковому вигляді. Необхідно, як і раніше, розрахувати площу, але потрібно рядковий тип перетворити на чисельний (float) при розрахунку площі area. Не забудьте також додати до змінної show рядок з наступним шаблоном: 'With width <значення ширини> and length <значення довжини> of the room, its area is equal to <значення площі>'."""


length = "2.75"
width = "1.75"
area = float(length) * float(width)
show = f"With width {width} and length {length} of the room, its area is equal to {area}"