"""ЗАВДАННЯ: ВІДСТАНЬ МІЖ МІСТАМИ"""


"""Програмісти часто працюють із геоданими. Попрацюємо і ми з ними. Нам необхідно написати програму, в якій ми розрахуємо відстань між двома точками на поверхні Землі.

Рахуватимемо відстань між двома містами: Києвом та Лондоном

Координати Києва в градусах:

Широта lat1 = 50.45
Довгота lon1 = 30.523
Координати Лондона в градусах:

Широта lat2 = 51.5072
Довгота lon2 = -0.1275
Радіус Землі приймемо 6371.01 км. Відстань у кілометрах між містами з урахуванням викривленості планети можна знайти за такою формулою:

distance = 6371.01 · arccos(sin(lat1) · sin(lat2) + cos(lat1) · cos(lat2) · cos(lon1 - lon2))

Пам'ятайте, що тригонометричні функції в Python оперують радіанами. Тобто величини із градусів необхідно перекласти у радіани, перш ніж обчислювати відстань між точками. Для цього в модулі math є функція radians

<радіани> = math.radians(<градуси>)
Також:

arccos(x) — це math.acos(x)
sin(x) — це math.sin(x)
cos(x) — це math.cos(x)
Обчисліть distance за вказаною формулою за допомогою запропонованих методів модуля math."""


import math

RADIUS = 6371.01

lat1 = 50.45
lat1 = math.radians(lat1)
lon1 = 30.523
lon1 = math.radians(lon1)

lat2 = 51.5072
lat2 = math.radians(lat2)
lon2 = -0.1275
lon2 = math.radians(lon2)

distance = RADIUS * math.acos(math.sin(lat1) * math.sin(lat2) + math.cos(lat1) * math.cos(lat2) * math.cos(lon1 - lon2))