"""Ми вже працювали з функцією введення, вона використовується для читання введення з клавіатури. Виклик цієї функції змушує інтерпретатор зупинити виконання програми та чекати введення користувача з клавіатури.

Якщо користувач натиснув клавішу Enter, всі введені раніше символи, після запрошення введення, повертаються функцією input, і виконання програми продовжується.

Щоб використовувати ці дані ми привласнюємо змінній значення, що поверне функція input. Наприклад, наступний приклад зчитує введення користувача з клавіатури та записує результат у змінну name.

name = input("Введіть ваше ім'я: ")
Функція input завжди повертає значення рядкового типу (string). Згідно з логікою, додатку необхідно виконати перетворення значення в цілий тип або дійсний тип.

У Python функції приведення типу заведено використовувати безпосередньо в тому ж виразі, де запитується введення з клавіатури.

count = int(input("Скільки яблук ви хочете купити? "))"""


"""При заповненні анкети на сайті нам необхідно через функцію input присвоїти відповідним змінним значення:

name - ваше ім'я, тип рядок
email - ваша електронна пошта, тип рядок
age - ваш вік, тип число int
height - ваш зріст, тип число float
is_active - чи бажаєте ви отримувати повідомлення від сайту, тип булевий"""


name = input("Your name? ")
email = input("Your e-mail? ")
age = int(input("How you old? "))
height = float(input("Your height? "))
is_active = True