"""За допомогою операторів ми виконуємо основні арифметичні операції. Символи, за допомогою яких виконуються операції Python, називаються операторами. Основні математичні оператори перераховані нижче у таблиці.

Символ	Операція
+	Додавання
-	Віднімання
*	Множення
/	Ділення
%	Залишок від ділення
//	Цілісний поділ
**	Зведення в ступінь
Приклад найпростішої операції:

a = 5
b = a - 3  # 2
Ми зробили операцію віднімання: з числа 5 (зберігається в змінній a) відняли число 3 та отримали в змінній b число, що дорівнює 2"""

"""Нехай нам необхідно розрахувати послуги споживання електрики. У змінній rate у нас знаходиться тариф за електроенергію 1.68, а в змінній value — значення показання лічильника, задайте для неї розумне ціле число в кіловатах. Розрахуйте та помістіть у змінну payment рахунок за електрику."""


rate = 1.68
value = 258
payment = rate * value