"""Математичні операції виконуються по черзі, залежно від їхнього пріоритету (якщо не задати іншу черговість за допомогою дужок). Множення та ділення мають вищий пріоритет, ніж додавання та віднімання.

ratio = 10
result = 8 * (ratio + 5) - ratio ** 2
Виразом називається сукупність змінних, операцій, імен функцій, дужок, які можна обчислити відповідно до синтаксису Python.

Наприклад, 8 * (ratio + 5) - ratio**2 - це вираз, 8 * (ratio + 5) - вираз, ratio**2 - вираз і т.д.

Якщо виникає подвійна ситуація при читанні виразу, намагайтеся їх групувати разом, за допомогою дужок. Візьмемо, наприклад, зведення у ступінь негативного числа -3 і зведемо його у квадрат. На папері ми вчинили б саме так:

-3 ** 2  # -9
Ми отримаємо -9, але це швидше за все не той результат, що ви хотіли. А річ у тім, що в Python пріоритет операції зведення в ступінь вищий за заперечення. Тому обертаємо -3 у дужки та отримуємо очікуваний результат.

(-3) ** 2  # 9"""


"""Повернемося до попереднього завдання. У змінній rate у нас знаходиться тариф за електроенергію — 1.68. Але тепер нам потрібно вести розрахунок денного та нічного тарифу. Нічний тариф розраховується як половина денного, тобто. rate треба поділити на 2. У змінній value_day — денні показання лічильника, а в змінній value_night — нічні. Знову ж таки, задайте для них розумне ціле число кіловат. Розрахуйте та помістіть у змінну payment рахунок за електрику, але вже з урахуванням денного та нічного тарифів."""


rate = 1.68
value_day = 120
value_night = 80
payment = (rate * value_day) + (rate * value_night / 2)