"""Математичні операції виконуються по черзі, залежно від їхнього пріоритету (якщо не задати іншу черговість за допомогою дужок). Множення та ділення мають вищий пріоритет, ніж додавання та віднімання.

ratio = 10
result = 8 * (ratio + 5) - ratio ** 2
Виразом називається сукупність змінних, операцій, імен функцій, дужок, які можна обчислити відповідно до синтаксису Python.

Наприклад, 8 * (ratio + 5) - ratio**2 - це вираз, 8 * (ratio + 5) - вираз, ratio**2 - вираз і т.д.

Якщо виникає подвійна ситуація при читанні виразу, намагайтеся їх групувати разом, за допомогою дужок. Візьмемо, наприклад, зведення у ступінь негативного числа -3 і зведемо його у квадрат. На папері ми вчинили б саме так:

-3 ** 2  # -9
Ми отримаємо -9, але це швидше за все не той результат, що ви хотіли. А річ у тім, що в Python пріоритет операції зведення в ступінь вищий за заперечення. Тому обертаємо -3 у дужки та отримуємо очікуваний результат.

(-3) ** 2  # 9"""