"""У Python вбудовані також комплексні числа. Запис таких чисел відбувається у вигляді пари значень: дійсної та уявної частини, які поділяються символом операції додавання. На кінці уявної складової частини комплексного числа обов'язково ставлять букву j. У наступному прикладі ми створюємо комплексну змінну:

complex = 3.14 + 1j
print(complex)  # (3.14+1j)
Щоб отримати дійсну та уявну частину чисел, окремо необхідно використовувати властивості real та imag:

complex = 3.14 + 1j
print(complex.real)  # 3.14
print(complex.imag)  # 1.0
Основна сфера застосування комплексних чисел — це наукові розрахунки з математики, квантової механіки, електротехніки тощо."""


"""Необхідно виконати додавання двох комплексних чисел (нагадаємо, що комплексні числа підтримують не всі математичні операції та не всі операції порівняння).
Перша змінна a дорівнює -2 + 3j і друга змінна b дорівнює 4 + 2.1j. Результат необхідно помістити у змінну result."""


a = -2 + 3j
b = 4 + 2.1j
result = a + b