"""Іноді потрібно зберегти велику кількість словників у списку або зберегти список як значення елемента словника. Створення складних структур такого роду називається вкладенням.

Наприклад, можна створити список користувачів, в якому кожен елемент є словником з інформацією про користувача. Наступний код будує список із трьох користувачів:

user_1 = {"name": "Jane", "age": 21}
user_2 = {"name": "Moris", "age": 23}
user_3 = {"name": "Steve", "age": 24}

persons = [user_1, user_2, user_3]

for user in persons:
    for field in user:
        print(user.get(field))
Вивід ми отримаємо наступний:

Jane
21
Moris
23
Steve
24
Іноді зручно помістити список у словник. Наприклад, ми описуємо у програмі рецепт. Якщо обмежитися тільки списком, зберегти вийде лише список інгредієнтів. При використанні словника список інгредієнтів може бути всього лише одним з полів опису рецепта.

Можна для деяких завдань вкладати списки в списки, головне пам'ятати, що глибина вкладення списків та словників не повинна бути великою. Якщо вам доводиться вкладати елементи на глибину істотно більшу, ніж у два-три рази, швидше всього, завдання має простіше рішення. Ми все ж таки живемо у тривимірному світі, хіба що ви Шелдон Лі Купер, займаєтеся теорією струн і у вас конструкція 11-мірної супергравітації :)"""


"""Потрібно написати функцію реалізації наступного ігрового алгоритму. На вхід функції game подається два аргументи: список, що складається зі списків, та початкове значення power - енергія гравця. Внутрішні списки — це списки з числовим значенням енергії, які може поглинути гравець, якщо вони менші або дорівнюють його енергії. Після поглинання елементу списку він рухається за списком далі та, або поглинає список повністю до кінця, або, якщо знаходить енергію вище за власну, залишає його і переходить до наступного списку. Наприкінці обходу всіх списків функція повинна повернути загальну отриману енергію гравця.

Приклад списку:

[[1, 1, 5, 10], [10, 2], [1, 1, 1]]
Для цього списку і початкової енергії рівної 1 гравець поглине з першого списку перші два значення і залишить його, зустрівши значення 5, через те, що на цей момент матиме енергію в 3. Другий список пропустить відразу, а третій повністю поглине та отримає остаточну енергію в 6."""


terra = [[1, 1, 5, 10], [10, 2], [1, 1, 1]]
power = 1

def game(terra, power):
    if len(terra) > 0:
        for i in terra:
            print(i)
            if len(i) > 0:
                for j in i:
                    if power >= j:
                        power += j
                    else:
                        break

            else:
                power = power
    else:
        power = power

    print(power)
    return power

game(terra, power)