"""Бувають ситуації, коли необхідно вийти з циклу до завершення ітерації, не чекаючи, доки відбудеться чергова перевірка умов. Для цього є команда break. Команда break зупиняє цикл у момент виклику та не завершує ітерацію.

Нескінченні цикли часто застосовуються там, де треба взаємодіяти з клієнтом, чекаючи на введення якогось значення від нього, і завершуватися цикл тільки якщо настане певна умова.

Тепер приклад із попереднього етапу ми могли б записати більш лаконічно

while True:
    num = int(input("Введіть число (0 для виходу): "))
    if num == 0:
        break
    repeat = int(input("Скільки разів помножити число на 2? "))
    for i in range(repeat):
        num = num * 2
    print(num)
У нас вийшов нескінченний цикл, який переривається оператором break, коли ми вводимо 0"""


"""Перепишіть попередній приклад, але використовуючи оператор break.

Напишіть два подвійні цикли. У першому циклі while ми постійно запитуємо ціле число, а у другому за допомогою циклу for обчислюємо суму чисел від 0 до введеного числа. Вихід з першого циклу здійснюємо, якщо ввели число 0, за допомогою оператора break.

Тести використовують дві тестові послідовності чисел:

10, 13, 73, 0 і чекають на суму 2847
1, 2, 3, 4, 0 і чекають на суму 20"""


num = int(input("Enter integer (0 for output): "))
sum = 0
while True:
    if num != 0:
        for i in range(num +1):
            sum = i + sum
        print(sum)
            
        num = int(input("Enter integer (0 for output): "))
    else:
        break