"""Вираз if-elif-else ми будемо використовувати у випадках, коли перед нами стає вибір із кількох альтернатив. Вираз починається з частини if, за якою слідує частина elif, а завершується конструкція блоком else.

Всі ці частини висловлювання мають містити правильні відступи. Крім того, всі інструкції if та elif повинні включати умови, результатом обчислення яких може бути або True, або False

Щоб було зрозуміло, перепишемо попередній приклад і введемо третю умову — перевірку на нуль.

num = float(input("Введіть число: "))

if num > 0:
    result = "Число додатне"
elif num == 0:
    result = "Це ноль"
else:
    result = "Число від'ємне"

print(result)
Зауважимо, що блок else у конструкції if-elif-else є необов'язковим."""


"""Як відомо, зазвичай розробників заведено поділяти на три категорії: Джун (Junior) & mdash; молодший спеціаліст, Мідл ( Middle) — основний розробник у компанії та Сеньйор (Senior) — старший розробник. Орієнтовно можна вважати, що до 1 року роботи включно — це Джуніор, понад 5 років — це Сеньйор розробник, а від одного року до 5 включно — мідл.

Є змінна work_experience, що визначає стаж роботи програміста. Залежно від стажу роботи, присвоїти змінній developer_type значення "Junior", "Middle" або "Senior". Використовуйте, якщо необхідно, булеві оператори or та and під час перевірок."""


work_experience = int(input("Enter your full work experience in years: "))

if work_experience > 5:
    developer_type = "Senior"
elif work_experience <= 1:
    developer_type = "Junior"
else:
    developer_type = "Middle"
