"""Тернарні оператори – це запис умовних виразів у скороченій формі. Вони знаходять застосування, коли змінній необхідно привласнити значення в залежності від якоїсь умови.

message = "Welcome" if is_access else "Forbidden"
У цьому прикладі message зберігатиметься рядок залежно від значення логічної змінної is_access. Якщо значення is_access дорівнює True, то значення message дорівнюватиме "Welcome", а якщо значення is_access дорівнює False — у message буде "Forbidden"

Такий підхід дозволяє писати нам менше коду, замість кількох рядків оператора if...else....

У Python також існує короткий варіант тернарного оператора.

some_data = None
message = some_data or "Not data"
У цьому прикладі message містить рядок 'Not data' — це зручно, коли потрібно швидко перевірити значення та показати повідомлення, якщо значення None.

Зверніть увагу, що для скороченої форми використовується саме оператор or (АБО)."""


"""Виконайте завдання, щоб визначити парне число чи ні, за допомогою тернарного оператора.

Програма встановлює значення змінної is_even у True або False, залежно від того, чи є число в змінній num парним або непарним.

Підказка: перевірка на парність виконується порівнянням залишку від поділу на 2 з 0 або 1. Нагадаємо, залишок від ділення можна отримати після операції %"""


num = int(input("Enter an integer number: "))

is_even = True if not num % 2 else False
