"""Цикл while виконуватиме заданий набір інструкцій доти, доки відповідний умовний вираз повертає True.

while умова:
    тіло циклу(заданий набір інструкцій)
Алгоритм роботи інструкції while наступний — якщо умовний вираз повертає True, тіло виконується, після чого знову проводиться перевірка умови, і так доти, поки умовний вираз не поверне значення False. Як тільки це сталося, тіло циклу буде пропущено, і виконання програми продовжиться з першої інструкції, наступної після тіла циклу while.

Розгляньмо приклад. Ми вводимо число num і, якщо воно лежить в межах від 0 до 10, ми виконаємо цикл в кількості (10 - num)

num = int(input("Введіть ціле число (0 до 10): "))
count = 10 - num
i = 1
while i <= count:
    print(f"Ітерація {i}")
    i = i + 1

print("Програма закінчена")
Приклад виводу для числа 7:

Введіть ціле число (0 до 10): 7
Ітерація 1
Ітерація 2
Ітерація 3
Програма закінчена"""


"""Користувач вводить число від 0 до 100. Підрахуйте, використовуючи цикл while, суму всіх чисел від першого до введеного числа включно в num. Результат помістити в змінну sum.

Тести будуть:

Поміщати тестові значення для змінної num: 20, 10, 5, 100

І чекати суми в змінній sum: 210, 55, 15, 5050"""


num = int(input("Enter the integer (0 to 100): "))
sum = 0
i = 1
while i <= num:
    sum += i
    i = i + 1

print(sum)
    
