"""У практиці програмування досить часто використовують Керівні символи . Це символи в кодуванні для яких не має графічного представлення, але які використовуються для керування пристроями, організації передачі даних та інших цілей.

Ось основні керівні символи:

Позначення у коді	Опис
\n	Переведення рядка
\f	Переведення сторінки
\r	Повернення каретки
\t	Горизонтальна табуляція
\v	Вертикальна табуляція
Для того, щоб можна було вводити ці символи, додають символ, що екранує '\', який означає, що наступний ним знак треба сприймати як спеціальний символ, а не буквально як він є.

Ці символи ми будемо активно використовувати в наступному модулі при роботі з текстовими файлами."""


"""Напишіть функцію real_len, яка підраховує та повертає довжину рядка без наступних керівних символів: [\n, \f, \r, \t, \v]

Для перевірки правильності роботи функції real_len їй будуть передані наступні рядки:

'Alex\nKdfe23\t\f\v.\r'
'Al\nKdfe23\t\v.\r'"""


text = 'Alex\nKdfe23\t\f\v.\r'
spec_symbs = ['\n', '\f', '\r', '\t', '\v']

def real_len(text):
    for i in spec_symbs:
        text = text.split(i)
        text = ''.join(text)
        lenth = len(text)
        print(text, lenth, sep='--')
    return lenth

real_len(text)